<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Java 8 JDK from Oracle.</string>
    <key>Identifier</key>
    <string>au.edu.nsw.chevalier.it.autopkgrecipes.munki.OracleJava8JDK</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OracleJava8JDK</string>
        <key>DOWNLOAD_URL</key>
        <string>http://www.oracle.com/technetwork/java/javase/downloads/jdk8-downloads-2133151.html</string>
        <key>ORACLE_LICENSE_COOKIE</key>
        <string>oraclelicense=accept-securebackup-cookie</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;http://download.oracle.com/otn-pub/java/jdk/.*?/jdk-8u[0-9]?[0-9]?-macosx-x64.dmg)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>request_headers</key>
                <dict>
                        <key>Cookie</key>
                        <string>%ORACLE_LICENSE_COOKIE%</string>
                </dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>